{
    "2021, 22 - Web developer (team) - Open Summer Of Code": {
        "My responsibilities:": [
            "Writing documentation, attending seminars, client meetings.",
            "(21) Create an application that parses academic papers' sources.",
            "(21) Research: API's, citation styles, client needs.",
            "(21) Development: Working on a front-end and programmatic interface.",
            "(22) Creating a working proof-of-concept that integrates Solidpods and Linked Data.",
            "(22) Linking the front- and back-end, researching API's and Solidpods."
        ],
        "What did I learn?": [
            "Importance of future-proofing and ensuring your projects longevity.",
            "Improved documentation efficiency through Notion, Gitbook, GitHub Pages, etc.",
            "Creating an accepting work environment is important for productivity!",
            "Continuous learning through hands-on projects.",
            "Importance of focusing on the end user experience."
        ]
    },
    "2021 - Web developer (solo) - Audiosense": {
        "My responsibilities:": [
            "Creating an at-home hearing test",
            "Integrating a web application into an existing and feature-limited webhost",
            "Scoping out features and expectations with the client"
        ],
        "What did I learn?": [
            "Communicating possibilities and technical limitations with clients (e.g. exact dB levels for users at home)",
            "Anticipating client needs (help with media license usage, design, etc.)",
            "Problem-solving skills related to client expectations."
        ]
    },
    "2018-21 - Programmer & ICT consultant - Guestcam": {
        "My responsibilities:": [
            "Handling the technological side of their projects",
            "Creating interfaces for tablets, touch-screen booths, desktop computers, etc.",
            "Solo development of web applications",
            "Building responsive and svg-based front-ends based on Photoshop mock-ups",
            "Troubleshooting portable Windows-based machines (through TeamViewer, telephone, and on location)"
        ],
        "What did I learn?": [
            "Collaboration and communication skills.",
            "Importance of software licensing.",
            "Increased productivity resulting from clear working hours and a good work-life balance.",
            "Independent working with limited guidance.",
            "Working with limited resources: no access to servers, no financial budget, etc."
        ]
    }
}